/*
Qt — это кроссплатформенный C++ фреймворк для создания приложений с графическим интерфейсом

Модули Qt

Основные:

Qt Core — база: строки, файлы, контейнеры, события
Qt GUI — графика, шрифты, изображения
Qt Widgets — кнопки, окна, поля ввода и т.д.

Частые классы:
QWidget — базовый виджет
QPushButton — кнопка
QLabel — текст / картинка
QLineEdit — однострочный ввод
QTextEdit — многострочный текст
boBox, QCheckBox, QRadioButton, QSpinBox, QSlider
QListWidget, QTableWidget



QApplication app(argc, argv);
Это сердце Qt-приложения:
Управляет циклом событий
Обрабатывает ввод с мыши/клавы
Без него GUI не запустится


Layout’ы (менеджеры компоновки)
Зачем:
Чтобы элементы нормально располагались и не ломались при изменении размера окна.
QVBoxLayout — вертикально
QHBoxLayout — горизонтально
QGridLayout — таблица (сетка)

Методы:
addWidget(widget)
addLayout(layout)
addStretch() — пружина (пустое место)
Можно вкладывать layout’ы друг в друга.
*/